---
type: Profile
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# Profile

`Autodesk.Revit.DB.Profile` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Clone | — | `public Profile Clone ()` |
| Property | Curves | — | `public CurveArray Curves { get ; }` |
| Property | Filled | — | `public bool Filled { get ; set ; }` |
| Property | Transformed | — | `public Profile this [ Transform transform ] { get ; }` |